Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་མངོན་པར་ཤེས་པ་མྱུར་བ་དང་ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་པ་འཐོབ་བོ། །
en: They attain the swift higher cognitions and mastery over all phenomena through the perfection of diligence.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་ལུས་དང་སེམས་ཡིད་དུ་འོང་བ་དང་། གཟུངས་དང་སྤོབས་པ་རྣམ་པ་ཐ་དད་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་སྤོང་བ་འཐོབ་བོ། །
en: They attain a pleasant body and mind, dhāraṇī, confident eloquence, and the abandonment of the obscuration of the afflictive emotions through the perfection of meditative stability.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་འཐོབ་བོ། །
en: They attain fearlessness and the four correct discernments through the perfection of insight.

source: ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་བྱ་སླ་བ་དང་། ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་ཁ་ན་མ་ཐོ་བ་མེད་པ་འཐོབ་བོ། །
en: They attain ease and irreproachability in physical, verbal, and mental actions through the perfection of skillful means.

source: སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་སྐྱེ་བ་ཐམས་ཅད་དུ་སྐྱེ་བ་དྲན་པ་དང་། ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འགྲོ་བ་དང་། ཇི་ལྟར་འདོད་པ་བཞིན་དུ་དགའ་བར་འགྱུར་བ་འཐོབ་བོ། །
en: They attain the ability, in every life, to recall their previous lives, to go wherever they wish, and to take joy in whatever they wish through the perfection of aspiration.

source: སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་དང་། བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བ་དང་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་འཐོབ་བོ། །
en: They will not be overcome by any afflictive emotion, māra, or adversary and will achieve eminence through the perfection of strength.

source: ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་ཕུང་པོ་དང་། འཆི་བདག་དང་ཉོན་མོངས་པ་དང་། ལྷའི་བུའི་བདུད་ལས་ཡང་དག་པར་འདའ་བ་འཐོབ་སྟེ།
en: They will reach transcendence over the māras of the aggregates, death, the afflictive emotions, and the divine māra through the perfection of wisdom.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྦྱིན་པའི་བསྔགས་པ་སྨྲ་བ་ཡང་ཡིན་ལ་སྦྱིན་པས་དག་གོ་སྙམ་དུ་ཡང་མི་སྙེམས་སོ། །དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་དང་།
en: “Furthermore, child of good family, bodhisattva praise generosity but do not arrogantly think, ‘I am pure because of generosity.’

source: བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཐབས་དང་།
en: In the same way, they praise discipline, patience, diligence, meditative stability, insight, skillful means, aspirations, strength, and wisdom, but do not arrogantly think, ‘I am pure because of wisdom.’

source: སྨོན་ལམ་དང་།
en: Why?

source: སྟོབས་དང་། ཡེ་ཤེས་ཀྱི་བསྔགས་པ་སྨྲ་བ་ཡང་ཡིན་ལ་ཡེ་ཤེས་ཀྱིས་དག་གོ་སྙམ་དུ་ཡང་མི་སྙེམས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་དེ་དག་ཐམས་ཅད་ནི་ཡང་དག་པར་བསྒྲུབས་ནས་སྤང་བར་བྱའོ། །
en: Because these things should be abandoned once they are achieved.

source: འདི་དག་ཐམས་ཅད་ནི་ཡོངས་སུ་བརྟགས་པ་ལས་བྱུང་བའོ། །དེ་བས་ན་གང་ཡོངས་སུ་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ལས་བྱུང་བའི་ཆོས་དེ་དག་ནི་སྤང་བར་བྱའོ། །
en: They all arise through conceptual designation, and any conceptual designation, any phenomena that arise through conceptual designation, should be abandoned.

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཡོངས་སུ་རྟོག་པ་དང་ཡོངས་སུ་རྟོག་པ་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱིས་དག་གོ་སྙམ་དུ་མི་སྙེམས་ཏེ།
en: That is why bodhisattvas do not arrogantly think, ‘I am pure because of phenomena that are conceptual designations and that arise through conceptual designation.’

source: གཞན་དུ་ན་རྣམ་པར་མི་རྟོག་པ་སྤྲོས་པ་མེད་པའི་ཡུལ་གྱིས་ཡེ་ཤེས་ཐོབ་ནས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Instead, bodhisattvas reach completely perfect awakening upon attaining wisdom by means of referents that are nonconceptual and conceptually unelaborate.”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ཆོས་གང་གི་ཚིག་བླ་དགས།
en: Mativikrama asked, “Child of good family, what words describe this phenomenon called awakening?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ནི་རྣམ་པར་མི་རྟོག་པ། སྤྲོས་པ་མེད་པའི་ཆོས་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: The bodhisattva Nirārambha replied, “Child of good family, the words ‘nonconceptual and conceptually unelaborate’ describe awakening.

source: དེ་ལ་ངར་འཛིན་པའི་སྤྲོས་པ་ནི་བྱང་ཆུབ་མ་ཡིན་ཏེ།
en: The conceptual elaboration of grasping at an ‘I’ is not awakening.

source: ངར་འཛིན་པ་ཉེ་བར་ཞི་ཞིང་སྤྲོས་པ་མེད་པ་ནི་བྱང་ཆུབ་བོ། །
en: Quieting the grasping at an ‘I’ and being conceptually unelaborate is awakening.

source: ང་ཡིར་འཛིན་པའི་སྤྲོས་པ་ནི་བྱང་ཆུབ་མ་ཡིན་ཏེ།
en: The conceptual elaboration of grasping at ‘mine’ is not awakening.

source: ང་ཡིར་འཛིན་པ་ཉེ་བར་ཞི་ཞིང་སྤྲོས་པ་མེད་པ་ནི་བྱང་ཆུབ་བོ། །
en: Quieting the grasping at ‘mine’ and being conceptually unelaborate is awakening.

source: རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། སྡུག་བསྔལ་གྱི་རྒྱུན་གྱི་སྤྲོས་པ་ནི་བྱང་ཆུབ་མ་ཡིན་ཏེ། རྒ་བ་དང་།
en: The conceptual elaborations of old age, sickness, death, and the continuity of suffering are not awakening.

source: ན་བ་དང་། འཆི་བ་དང་། སྡུག་བསྔལ་གྱི་རྒྱུན་ཉེ་བར་ཞི་ཞིང་སྤྲོས་པ་མེད་པ་ནི་བྱང་ཆུབ་བོ། །སེར་སྣ་དང་།
en: Quieting the concepts of old age, sickness, death, and the continuity of suffering, and being conceptually unelaborate, is awakening.

source: འཆལ་པའི་ཚུལ་ཁྲིམས་དང་། གནོད་སེམས་དང་། ལེ་ལོ་དང་། རྣམ་པར་གཡེང་བ་དང་། འཆལ་བའི་ཤེས་རབ་ཀྱི་སྤྲོས་པ་ནི་བྱང་ཆུབ་མ་ཡིན་ཏེ།
en: The conceptual elaborations of stinginess, poor discipline, maliciousness, laziness, distraction, and faulty insight are not awakening.

source: སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་།
en: Conceptually unelaborate generosity, discipline, patience, diligence, meditative stability, and insight are awakening.

source: ཤེས་རབ་སྤྲོས་པ་མེད་པ་ནི་བྱང་ཆུབ་བོ། །ལྟ་བ་དང་རྣམ་པར་རྟོག་པ་དང་། སྨོན་ལམ་གྱི་སྤྲོས་པ་ནི་བྱང་ཆུབ་མ་ཡིན་ཏེ།
en: The conceptual elaborations of view, concept, and aspiration are not awakening.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། སྤྲོས་པ་མེད་པ་ནི་བྱང་ཆུབ་བོ། །
en: Emptiness, signlessness, wishlessness, and being conceptually unelaborate are awakening.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་བོ། །ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་མ་ཡིན་ནོ། །
en: “Furthermore, all phenomena are awakening, and all phenomena are not awakening.”

source: སྨྲས་པ་རྣམ་གྲངས་གང་གིས་ན་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་ཡིན་ལ། ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཀྱང་མ་ཡིན།
en: Mativikrama then asked, “By what calculation are all phenomena both awakening and not awakening?”

source: སྨྲས་པ། ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཁོང་དུ་ཆུད་པ་ནི་བྱང་ཆུབ་བོ། །
en: Nirārambha replied, “Understanding the equality of all phenomena and the suchness of all phenomena is awakening.

source: ཆོས་ཐམས་ཅད་ལ་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལ་མངོན་པར་ཆགས་པ་ནི་བྱང་ཆུབ་མ་ཡིན་ནོ། །
en: The fixation of grasping at ‘I’ and ‘mine’ in relation to any phenomena is not awakening.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །ཉེ་བར་ཞི་ཞེས་བྱ་བ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: “Furthermore, child of good family, that which is known as awakening is described by the word quiescence, and quiescence is a word that describes the suchness of all phenomena.”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་དེ་བཞིན་ཉིད་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་དེ་གང་གི་ཚིག་བླ་དགས།
en: “Child of good family, what suchness is it that the word suchness describes?”

source: སྨྲས་པ།
en: asked Mativikrama.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་ཉིད་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་ཏེ།
en: Nirārambha replied, “Child of good family, the suchness indicated by the word suchness is another word for emptiness.

source: སྟོང་པ་དེ་ནི་མི་སྐྱེ་མི་འགག་གོ། །སྨྲས་པ།
en: This emptiness does not arise or cease.”

source: གང་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འདི་སྐད་དུ་ཆོས་ཐམས་ཅད་ནི་སྟོང་པའོ་ཞེས་གསུངས་ཏེ། དེ་བས་ན་ཆོས་ཐམས་ཅད་ནི་མི་སྐྱེ་མི་འགག་གོ། །
en: Mativikrama then said, “If the Blessed One indeed said, ‘All phenomena are empty,’ then no phenomena arise or cease.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །
en: The bodhisattva Nirārambha replied, “Child of good family, that is exactly how it is.

source: ཇི་ལྟར་ཁོང་དུ་ཆུད་པ་བཞིན་ཏེ། ཆོས་ཐམས་ཅད་ནི་མི་སྐྱེ་མི་འགག་གོ། །
en: Just as you understand it, no phenomena arise or cease.”

source: སྨྲས་པ། གང་འདི་བཅོམ་ལྡན་འདས་ཀྱིས་འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་སྐྱེའོ། །འགག་གོ་ཞེས་གསུངས་ན། དེ་བཞིན་གཤེགས་པས་འདི་ཅི་ལས་དགོངས་ཏེ་གསུངས། སྨྲས་པ།
en: Mativikrama then asked, “When the Blessed One said, ‘All compounded phenomena arise and cease,’ what did the Thus-Gone One intend?”

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གནས་པ་སྐྱེ་བ་དང་འགག་པ་ལ་མངོན་པར་ཆགས་པས་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ཆེན་པོས་འཇིག་རྟེན་དང་ང་བའི་གནས་བསལ་བའི་ཕྱིར་ཐ་སྙད་ཀྱི་དབང་གིས་སྐྱེའོ། །འགག་གོ་ཞེས་གསུངས་ཏེ།
en: “Child of good family,” replied Nirārambha, “people in the world fixate on arising and ceasing.

source: འདི་ལ་ཆོས་གང་ཡང་སྐྱེ་བ་དང་འགག་པ་མེད་དོ། །
en: Therefore, the deeply compassionate Thus-Gone One sought to soothe the fear of such worldly people by speaking conventionally about arising and ceasing even though there are absolutely no phenomena that arise or cease.

source: དེ་བས་ན་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཤེས་པར་བྱ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཤེས་པར་བྱ། སེམས་ཅན་རྣམས་ཤེས་པར་བྱ། སེམས་ཅན་གྱི་ཆོས་རྣམས་ཤེས་པར་བྱ། བདག་ཤེས་པར་བྱ། བདག་གི་ཆོས་རྣམས་ཤེས་པར་བྱའོ། །
en: Therefore, child of good family, bodhisattvas should know the Buddha, the phenomena associated with a buddha, beings, the phenomena associated with a being, the self, and the phenomena associated with the self.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་དེའི་ཚེ་དོན་དེ་ཉིད་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་སྨྲས་པ། བྱང་ཆུབ་སེམས་དཔའ་བག་ཡོད་པས། །སངས་རྒྱས་འབྱུང་དང་སངས་རྒྱས་དང་། །སངས་རྒྱས་ཆོས་དང་དེ་དག་ནི། །རང་བཞིན་ཅི་འདྲ་རབ་ཏུ་ཤེས། །
en: The bodhisattva great being Nirārambha then made those same points in verse: “What is the nature Of the Buddha’s origin, The Buddha, and the Buddha’s qualities, Known to a vigilant bodhisattva?

source: སངས་རྒྱས་འཇིག་རྟེན་མཁྱེན་མཆོག་ནི། །ཟག་མེད་དགེ་བའི་ཕུང་པོ་སྟེ། །
en: “The Buddha, supreme knower of the world, Is a collection of undefiled virtues.

source: སེམས་ཅན་བསམ་པའི་དབང་གིས་འབྱུང་། །སྔོན་གྱི་འདུ་བྱེད་རྒྱུ་ལས་སྐྱེ། །
en: He arises through the wishes of beings And takes birth through previous karmic formations.

source: གང་གིས་སངས་རྒྱས་རྣམས་རྟོགས་པ། །དཔའ་བོ་དེ་ནི་ཕ་རོལ་ཕྱིན། །
en: “Perfect are the heroic, Who have realized buddhahood.

source: དེས་ནི་ཐམས་ཅད་ཡོངས་སུ་ཤེས། །དེས་ནི་ཐམས་ཅད་ཁོང་དུ་ཆུད། །
en: They know everything; They understand everything.

source: བྱང་ཆུབ་སུས་ཀྱང་མ་བྱིན་ཏེ། །གང་གིས་ཀྱང་ནི་བཟུང་བ་མེད། །
en: “No one can grant buddhahood, Nor can anyone hold on to it.

source: བདག་གི་ཆོས་རྣམས་ཡོངས་ཤེས་པས། །སངས་རྒྱས་ལ་ནི་སངས་རྒྱས་བརྗོད། །
en: The word buddha is said of those Who are buddhas through knowing the features of the self.

source: གང་གིས་བདག་ནི་རང་བཞིན་གྱིས། །འདུ་ཤེས་ཙམ་དུ་རྣམ་རིག་པ། །དེ་ནི་སངས་རྒྱས་ཅི་འདྲ་དང་། །བྱང་ཆུབ་རང་བཞིན་ཅི་འདྲ་ཤེས། །
en: “Those who innately know the self To be nothing more than perception Know what a buddha is like, As well as the nature of awakening.

source: འགྲོ་བ་ཐམས་ཅད་འདུ་ཤེས་ཙམ། །ཡོངས་སུ་རྟོག་པ་རྣམས་ཀྱིས་བརྗོད། །
en: “All beings are mere perceptions, And are described through conceptual constructs.

source: རྨི་ལམ་སྒྱུ་མ་ལ་སོགས་མཚན། །བྱང་ཆུབ་སེམས་དཔས་རྣམ་པར་རིག །
en: The terms illusion, dream, and the like Are well known to bodhisattvas.

source: ཇི་ལྟར་ཚུལ་འདི་ཤེས་འགྱུར་ཞེས། །གང་ཞིག་དེ་སྙམ་སེམས་འགྱུར་ན། །
en: “If someone were to wonder, ‘How is this way understood?’

source: དབང་པོའི་རྟ་རྣམས་རབ་བཏུལ་བ། །མཉམ་བཞག་དེས་ནི་རབ་ཏུ་ཤེས། །
en: They should know that meditative composure Tames the horses of the senses.

source: དེ་ལ་དགྲ་དང་ཟིན་མེད་དེ། །དགོས་པ་དང་ནི་མི་དགོས་མེད། །དོར་བ་མེད་ཅིང་གཟུང་བ་མེད། །ཡང་དག་ཆོས་བརྗོད་འདི་འདྲའོ། །
en: “Then there is neither foe nor friend, No purpose or lack of purpose, And no rejecting or clinging— Such is this Dharma discourse.

source: ཆོས་རྣམས་ཀུན་ལ་ཡང་དག་ཚིག །ཆོས་རྣམས་ཡང་དག་བརྗོད་ཅེས་བྱ། །
en: “True words about all phenomena Are called a discourse on phenomena.

source: དེ་དག་ཡང་དག་ཚིག་མིན་པ། །དེ་ནི་སྐྱོན་ཆགས་ཆོས་ཞེས་བརྗོད། །
en: Words about them that are not true Are called flawed Dharma.

source: འདོད་ཆགས་ཆོས་དང་འདོད་མེད་ནི། །དག་པ་རྣམས་ཀྱིས་མཉམ་པར་མཐོང་། །
en: “The qualities of attachment and nonattachment Are seen as equal by those who are pure.

source: དེ་བཞིན་ཞེ་སྡང་གཏི་མུག་སྟེ། །འདི་ནི་ཆོས་རྣམས་ཡང་དག་བརྗོད། །
en: Such is also the case for anger and dullness— This is a discourse on phenomena.

source: སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །སྙིང་རྗེའི་བདག་ཉིད་གོ་བགོས་པ། །གང་ཞིག་རང་བཞིན་སྟོང་མིན་པ། །སེམས་ཅན་རབ་ཏུ་མི་མཐོང་སྟེ། །
en: “One who, for the benefit of all beings, Has donned the armor of intrinsic compassion Does not see any being Who is not empty of innate nature.

source: དེ་ལྟར་ཆོས་ཉིད་གང་ཤེས་ཤིང་། །རྟག་ཏུ་ཀུན་ཏུ་དྲི་མེད་ལ། །འཇིགས་མེད་ཐང་ལ་ཕྱིན་དེ་དག །སངས་རྒྱས་ཁོང་དུ་ཆུད་པར་འགྱུར། །
en: “Those who know the basic nature as such, And have reached the state of fearlessness About what is always entirely stainless, Will come to realize buddhahood.

source: དཔེར་ན་སྒྱུ་མ་མཁན་པོ་ཞིག །སྤྲུལ་པ་ཐར་པར་བྱ་ཕྱིར་བརྩོན། །
en: “A skilled magician will, for example, Try to release their magical creations.

source: དེས་ནི་སྔ་ནས་དེ་ཤེས་པས། །སྤྲུལ་པ་དེ་ལ་ཆགས་པ་མེད། །
en: They know them to be magic from the start, And so have no attachment to them.

source: སྲིད་གསུམ་སྤྲུལ་པ་འདྲ་བར་ནི། །རྫོགས་པའི་བྱང་ཆུབ་མཁས་པས་ཤེས། །
en: “An awakened wise person Knows the three worlds to be like a magical creation.

source: འགྲོ་བའི་ཆེད་དུ་གོ་བགོས་ཏེ། །འགྲོ་བ་དེ་ལྟར་སྔ་ནས་ཤེས། །
en: They don armor to serve beings, Knowing them to be such from the start.

source: བདག་ནི་ཡང་དག་མ་ཡིན་ཞིང་། །སེམས་ཅན་རང་བཞིན་སྟོང་པར་མཐོང་། །
en: “They see the self as imperfect, And beings as empty by nature.

source: ཀུན་ཏུ་སོང་བའི་ཆོས་མཐོང་ནས། །བཟོད་པ་ཐོབ་སྟེ་ཐང་ལ་གནས། །
en: Seeing that phenomena are omnipresent, They reach acceptance and remain in that state.

source: གང་དུའང་འཇུག་པ་མ་ཡིན་ཏེ། །གང་ནས་ཀྱང་ནི་ལྡོག་མེད་པ། །
en: “There is nothing at all to accept, And there is nothing at all to reject.

source: དེ་ནི་འཇུག་མེད་ལྡོག་མེད་དེ། །ཐང་ལ་གནས་པའི་བྲམ་ཟེའོ། །
en: A brahmin is one who maintains that state, In which there is no accepting or rejecting.

source: ནམ་ཞིག་བསམ་པ་མཉམ་པ་ཡིས། །ཡང་དག་ཆོས་ཀྱི་དབྱིངས་ལ་གནས། །དེ་ཚེ་སངས་རྒྱས་རྣམས་ཀྱིས་འདི། །རྫོགས་པའི་སངས་རྒྱས་འགྱུར་ལུང་སྟོན། །
en: “When someone rests with an even disposition In the perfect expanse of phenomena, The buddhas will prophesy That they will be a perfect buddha.

source: ནམ་ཞིག་བདག་ནི་ཇི་ལྟ་བར། །དེ་བཞིན་སངས་རྒྱས་ལུང་བསྟན་དག །མཐོང་བའི་དྲི་མ་བོར་བ་ནི། །རྒྱལ་བ་རྣམས་ཀྱིས་ལུང་སྟོན་ཏོ། །
en: “When I cast aside The stains of seeing, Just as the buddhas predicted, The victors made their prophesy.

source: སྒྲིབ་པ་མེད་པའི་དབྱིངས་གནས་ནས། །དེ་ནས་མྱ་ངན་འདས་ལ་སྤྱོད། །
en: “Resting in the unobscured expanse, I then progress from there toward nirvāṇa.

source: སྙིང་རྗེ་ཆེན་པོའི་བདག་ཉིད་ནི། །ཀུན་ཏུ་ཁ་ན་མ་ཐོ་མེད། །
en: Embodying great compassion, I am entirely free of blame.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་ལྡན་གང་། །ཆོས་རྣམས་ཡང་དག་བརྗོད་འདོད་ཅིང་། །ཡང་དག་ཆོས་བརྗོད་དོན་གཉེར་དེ། །ཡང་དག་ཆོས་བརྗོད་འདི་བགྲོད་དོ། །
en: “An intelligent bodhisattva Who desires a perfect discourse on phenomena, And who seeks a discourse on the Dharma, Will follow this Dharma discourse.”

source: སེམས་ཅན་ཆེན་པོ་དེས་ཚིགས་སུ་བཅད་པ་བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: When this great being finished his versified explanation, thirty-two thousand bodhisattvas attained acceptance of the nonarising of phenomena.

source: ལྷའི་བུ་བརྒྱད་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་དང་བྲལ་ཞིང་དྲི་མ་མེད་པ་རྣམ་པར་དག་གོ། །།བམ་པོ་བཞི་པ།
en: For eight thousand gods, dust fell away from their Dharma eye that sees phenomena, and they became stainless and pure.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྣམ་པར་གནོན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ནི་བདེན་པ་གཅེས་སུ་བྱ་སྟེ།
en: Then the bodhisattva great being Nirārambha addressed the bodhisattva great being Mativikrama: “Child of good family, a bodhisattva should privilege the truth.

source: རིགས་ཀྱི་བུ་བདེན་པ་ཡང་དག་པར་བརྗོད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཡང་དག་པར་བརྗོད་པའོ། །
en: Child of good family, a bodhisattva’s discourse on the Dharma is a discourse on the truth.

source: རིགས་ཀྱི་བུ་དེ་ལ་བདེན་པ་གང་ཞེ་ན། གང་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་སེམས་དེ་སྲོག་གི་ཕྱིར་ཡང་ཡོངས་སུ་མི་འདོར་ཞིང་། སེམས་ཅན་རྣམས་ལ་ལོག་པར་ཡང་མི་སྒྲུབ་པ་སྟེ།
en: Child of good family, what is this truth that compels a bodhisattva who has generated the mind set on unsurpassable, completely perfect awakening to not forsake that mind even at the cost of their life and to not act adversely toward beings?

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པའོ། །
en: It is the truth of a bodhisattva.

source: གང་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། ཕྱིས་སེམས་དེ་འདོར་ཞིང་སེམས་ཅན་ཐམས་ཅད་ལ་ལོག་པར་སྒྲུབ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་རབ་ཏུ་སྨད་པའི་བརྫུན་དུ་སྨྲ་བའོ། །
en: It would be a despicable lie to say that a bodhisattva would generate the mind set on unsurpassable, completely perfect awakening only to forsake it later and act adversely toward beings.”

source: སྨྲས་པ། ཇི་ལྟར་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། སེམས་དེ་ཕྱིས་ཡོངས་སུ་མི་འདོར་ཞིང་སེམས་ཅན་ཐམས་ཅད་ལ་ལོག་པར་མི་སྒྲུབ་པ་ཡིན།
en: Mativikrama asked, “Once they have generated the mind set on unsurpassable, completely perfect awakening, why will they not later forsake it and not act adversely toward any being?”

source: སྨྲས་པ། ནམ་བྱང་ཆུབ་སེམས་དཔའ་སྡུག་བསྔལ་གྱི་བདེན་པ་ཤེས་ཤིང་། ཀུན་འབྱུང་བའི་བདེན་པ་དང་། འགོག་པའི་བདེན་པ་དང་། ལམ་གྱི་བདེན་པ་ཤེས་པ་ན་དེ་སེམས་དེ་ཡོངས་སུ་མི་འདོར་ཞིང་སེམས་ཅན་ཐམས་ཅད་ལའང་ལོག་པར་མི་སྒྲུབ་པ་ཡིན་ནོ། །
en: Nirārambha replied, “When bodhisattvas understand the truth of suffering, when they understand the truth of its origin, the truth of its cessation, and the truth of the path, they will not forsake that mind and will not act adversely toward any being.”

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་བདེན་པ་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པ་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་གོ། །སྨྲས་པ། སྡུག་བསྔལ་ནི་གང་ཤེས་པ་ནི་ཇི་ལྟ་བུ།
en: “What is the suffering that bodhisattvas know?”

source: ལེན་པའི་ཕུང་པོ་ལྔ་རྣམས་ལ་ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བའི་རྣམ་པར་སྨིན་པ་ནི་སྡུག་བསྔལ་ཏེ།
en: Nirārambha answered, “Suffering is the ripening of the experiences of pleasant and unpleasant in relation to the five aggregates that are the bases for clinging.

source: འདི་ནི་སྡུག་བསྔལ་ཞེས་བྱའོ། །
en: This is suffering.

source: ནམ་སྡུག་བསྔལ་དེ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། སྟོང་པ་དང་གཡོ་བ་མེད་པ་དང་། བདག་དང་བདག་གི་དང་བྲལ་བ་ཤེས་པ་འདི་ནི་སྡུག་བསྔལ་ཤེས་པ་ཞེས་བྱའོ། །
en: When bodhisattvas know that this suffering is dependently originated, empty, unwavering, and devoid of ‘I’ and ‘mine,’ they are said to ‘know suffering.’

source: ནམ་སྡུག་བསྔལ་དེ་ཀུན་འབྱུང་བ་ཙམ་དང་། རྫས་མེད་པ་དང་རྫས་མ་ཡིན་པ་དང་། སྙིང་པོ་མེད་པ་དང་བདག་པོ་མེད་པར་མཐོང་བ་འདི་ནི་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱའོ། །ནམ་སྡུག་བསྔལ་དེ་སྔོན་གྱི་མཐའ་ནས་ཀྱང་མ་འོངས། ཕྱི་མའི་མཐར་ཡང་མི་འཕོ།
en: When they see that suffering merely in terms of its origin, as insubstantial and immaterial, as essenceless and without agency, they are said to ‘know its origin.’

source: ད་ལྟར་བྱུང་བ་ལ་ཡང་མི་གནས་ཏེ། ཐོག་མ་མེད་པ་ཅན་ཡིན་ལ། རང་བཞིན་གྱིས་འགགས་པ། རང་བཞིན་གྱིས་སྟོང་པ། རང་བཞིན་གྱིས་དབེན་པར་ཤེས་པ་འདི་ནི་འགོག་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: When they know that there is nothing that comes from the previous life, migrates to the next life, or that arises in the present, when they know that suffering is beginningless and is naturally in a state of cessation, naturally empty, and naturally isolated, they are said to ‘know its cessation.’” “Child of good family, what’s another word for cessation?”

source: རིགས་ཀྱི་བུ་འགོག་པ་ཞེས་བྱ་བ་འདི་གང་གི་ཚིག་བླ་དགས། སྨྲས་པ། རིགས་ཀྱི་བུ་འགོག་པ་ནི་ཅིར་ཡང་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: “Child of good family,” replied Nirārambha, “there is nothing that can express cessation.”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་གལ་ཏེ་འགོག་པ་ནི་ཅིར་ཡང་བརྗོད་པར་བྱ་བ་མ་ཡིན་ན། དེ་ཅིའི་ཕྱིར་འགོག་པ་ཞེས་བྱ།
en: “Child of good family, if nothing can express cessation, why do we say ‘cessation’?”

source: རིགས་ཀྱི་བུ་འགོག་པ་ཞེས་བྱ་བ་ནི་གློ་བུར་སྒྲིབ་པ་མེད་པ། ཡང་དག་པ་མ་ཡིན་པ་ཡོད་པ་མ་ཡིན་པ། ཀུན་བརྟགས་པ་སྟེ།
en: “Child of good family,” answered Nirārambha, “cessation is free of adventitious obscurations; it is false, nonexistent, and an imputation.

source: ནམ་ཡང་དག་པ་མ་ཡིན་པ་དེ་ལ་ཀུན་ཏུ་མི་རྟོག་པ་དེ་ནི་འགོག་པ་ཞེས་བྱའོ། །
en: When something is false, it is an imputation. That is considered cessation.

source: ཡང་དག་པ་མ་ཡིན་པ་ཀུན་ཏུ་རྟོག་པ་འགག་པ་ན་ཆོས་གང་ཡང་འཇིག་པར་མི་འགྱུར་ཏེ།
en: A phenomenon that is false, an imputation, and ceases cannot be destroyed in any way.

source: དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་འགགས་པ་ཞེས་བྱའོ། །སྨྲས་པ།
en: Therefore, all phenomena are said to have utterly ceased.”

source: རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་འགོག་པ་མངོན་སུམ་དུ་མི་བྱེད་དོ། །
en: Mativikrama then said, “Child of good family, the Blessed One also said, ‘A bodhisattva does not actualize cessation.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་འགོག་པ་མངོན་སུམ་དུ་བྱེད་པ་དེ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་ངོ་ཞེས་གསུངས་ན།
en: A bodhisattva who actualizes cessation has fallen to the level of a śrāvaka or pratyekabuddha.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ཅི་ལས་དགོངས་ཏེ་གསུངས། སྨྲས་པ།
en: What did the Blessed One mean when he said that?”

source: རིགས་ཀྱི་བུ་མངོན་སུམ་དུ་བྱེད་ཅེས་བྱ་བ་འདི་ནི་བསྟན་དུ་མེད་པ།
en: “Child of good family,” answered Nirārambha, “the term actualize cannot be explained.

source: མངོན་སུམ་དུ་མཐོང་བའི་ཚིག་བླ་དགས་སོ། །
en: Another way to put it would be see directly.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འགོག་པ་ནི་བསྟན་དུ་མེད་པའི་ཆོས་སོ་ཞེས་གསུངས་སོ། །
en: The Blessed One also said, ‘Cessation is a phenomenon that cannot be explained.’

source: ཆོས་གང་བསྟན་དུ་མེད་པ་དེ་ནི་མངོན་སུམ་དུ་བྱ་བར་མི་ནུས་སོ། །
en: Any phenomena that cannot be explained cannot possibly be actualized.

source: དེ་བས་ན་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འགོག་པ་མངོན་སུམ་དུ་མི་བྱེད་མི་མཐོང་ངོ་ཞེས་གསུངས་ཏེ།
en: Therefore, the Blessed One said, ‘A bodhisattva can neither actualize nor directly see cessation.’

source: དེ་ལ་དགོངས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ནི་འགོག་པ་མངོན་སུམ་དུ་བྱེད་དོ། །
en: With that intended meaning in mind, he also said, ‘A bodhisattva does not actualize cessation.

source: ཉན་ཐོས་ནི་ཆོས་ལ་མཚན་མར་འཛིན་པའི་བློས་འགོག་པ་མངོན་སུམ་དུ་བྱེད་དོ། །
en: A śrāvaka has an intellect that grasps at a phenomenon’s attributes and thereby actualizes cessation.

source: གནས་སོ། །ཀུན་ཤེས་སོ་ཞེས་གསུངས་སོ། །
en: They remain that way and understand it as such.’

source: དམིགས་པ་དང་ཡིད་ལ་བྱེད་པ་གང་དག་གིས་འདི་ལྟར་ཤེས། འདི་ལྟར་མཐོང་།
en: Those who apprehend and fixate their minds understand cessation in this way and see it as such.

source: འདི་ལྟར་ངེས་པར་བྱེད་པ་འདི་ནི་ལམ་ཤེས་པ་ཞེས་བྱའོ། །
en: This kind of established certainty is what is known as knowing the path.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་སྡུག་བསྔལ་ཞེས་བྱ་བ་ནི་ངར་འཛིན་པའོ། །
en: “Furthermore, child of good family, suffering is to cling to the notion of ‘I.’

source: ང་ཡིར་འཛིན་པ་དེའི་རྒྱུ་དང་བཅས་པར་གང་འབྱུང་བ་འདི་ནི་ཀུན་འབྱུང་བ་ཞེས་བྱའོ། །
en: Its origin is the arising of clinging to ‘mine’ along with the causes of that clinging.

source: ནམ་དེའི་འབྱུང་བའི་ཆོས་གང་ཡང་སོ་སོར་ངེས་པ་མ་ཡིན་པར་མཐོང་བ་འདི་ནི་འགོག་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: Knowing cessation is the recognition that there are no restrictive determinations of phenomena when they arise.

source: གང་དེ་ལྟར་རྣམ་པར་མཐོང་ཞིང་ཚོལ་བ་འདི་ནི་ལམ་ཤེས་པ་ཞེས་བྱའོ། །
en: Knowing the path is recognizing that and pursuing it.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་གང་སྙེམས་པ་དེ་ནི་སྡུག་བསྔལ་བའོ། །
en: “Furthermore, child of good family, arrogance is suffering.

source: རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཀྱིས་སྙེམས་པའི་རང་བཞིན་ནི་སྡུག་བསྔལ་ལོ་ཞེས་གསུངས་སོ། །
en: Child of good family, the Blessed One said, ‘The nature of arrogance is suffering.’
